{"format": "graph-model", "generatedBy": "2.13.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "signature": {"inputs": {"Input": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "5"}]}}}, "outputs": {"Output": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "unknown_24", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_22", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_20", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}, {"size": "24"}, {"size": "468"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_17", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}}}, {"name": "unknown_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}, {"size": "24"}, {"size": "468"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_14", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}}}, {"name": "unknown_12", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}, {"size": "24"}, {"size": "468"}]}}}}}, {"name": "unknown_11", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}}}, {"name": "unknown_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}, {"size": "24"}, {"size": "468"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}, {"size": "24"}, {"size": "468"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Constant_20", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "468"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}}}, {"name": "StatefulPartitionedCall/Cast_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "8192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Mul_10", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_ConstantOfShape_8", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Unsqueeze_3/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Concat_4/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ones/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "Func/StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/then/_29/output/_43", "op": "Const", "attr": {"dtype": {"type": "DT_BOOL"}, "value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Unsqueeze_14/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/onnx_tf_prefix_Concat_15_partial_split_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Concat_15/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/zeros_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Concat_17/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_13", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}, {"size": "24"}]}}}}}, {"name": "unknown_16", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_19", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_21", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}, {"size": "64"}]}}}}}, {"name": "unknown_23", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/pivot_t/_33", "op": "Const", "attr": {"dtype": {"type": "DT_BOOL"}, "value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/LogicalAnd", "op": "Const", "attr": {"dtype": {"type": "DT_BOOL"}, "value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/assert_equal_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_1/All", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "5"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/StatefulPartitionedCall/assert_equal_1/All/_34", "op": "Switch", "input": ["StatefulPartitionedCall/assert_equal_1/All", "StatefulPartitionedCall/assert_equal_1/All"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/StatefulPartitionedCall/LogicalAnd/_35", "op": "Switch", "input": ["StatefulPartitionedCall/LogicalAnd", "StatefulPartitionedCall/assert_equal_1/All"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/StatefulPartitionedCall/assert_equal_1/y/_36", "op": "Switch", "input": ["StatefulPartitionedCall/assert_equal_1/y", "StatefulPartitionedCall/assert_equal_1/All"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/switch_pred/_31", "op": "Switch", "input": ["StatefulPartitionedCall/assert_equal_1/All", "StatefulPartitionedCall/assert_equal_1/All"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Shape_0", "op": "Shape", "input": ["input"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT64"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT64"}]}]}}, {"name": "StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/pivot_f/_32", "op": "Identity", "input": ["StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/switch_pred/_31"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_BOOL"}}}, {"name": "Func/StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/else/_30/input/_46", "op": "Identity", "input": ["StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/StatefulPartitionedCall/assert_equal_1/All/_34", "^StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/pivot_f/_32"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "Func/StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/else/_30/input/_47", "op": "Identity", "input": ["StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/StatefulPartitionedCall/LogicalAnd/_35", "^StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/pivot_f/_32"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "Func/StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/else/_30/input/_48", "op": "Identity", "input": ["StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/StatefulPartitionedCall/assert_equal_1/y/_36", "^StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/pivot_f/_32"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/else/_30/assert_equal_1/Assert/AssertGuard/Assert", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/else/_30/input/_46", "^Func/StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/else/_30/input/_47", "^Func/StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/else/_30/input/_48"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/else/_30/assert_equal_1/Assert/AssertGuard/Identity_1", "op": "Identity", "input": ["Func/StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/else/_30/input/_46", "^StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/else/_30/assert_equal_1/Assert/AssertGuard/Assert"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/branch_executed/_38", "op": "Merge", "input": ["StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/pivot_t/_33", "StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/pivot_f/_32", "^StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/else/_30/assert_equal_1/Assert/AssertGuard/Assert"], "attr": {"_has_manual_control_dependencies": {"b": true}, "N": {"i": "2"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/output/_37", "op": "Merge", "input": ["Func/StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/then/_29/output/_43", "StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/else/_30/assert_equal_1/Assert/AssertGuard/Identity_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/FloorMod", "op": "Const", "input": ["^StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/output/_37"], "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Gather_2/axis", "op": "Const", "input": ["^StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/output/_37"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Gather_2", "op": "GatherV2", "input": ["StatefulPartitionedCall/onnx_tf_prefix_Shape_0", "StatefulPartitionedCall/FloorMod", "StatefulPartitionedCall/onnx_tf_prefix_Gather_2/axis"], "attr": {"Tparams": {"type": "DT_INT64"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Unsqueeze_3", "op": "ExpandDims", "input": ["StatefulPartitionedCall/onnx_tf_prefix_Gather_2", "StatefulPartitionedCall/onnx_tf_prefix_Unsqueeze_3/dim"], "attr": {"T": {"type": "DT_INT64"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Unsqueeze_14", "op": "ExpandDims", "input": ["StatefulPartitionedCall/onnx_tf_prefix_Gather_2", "StatefulPartitionedCall/onnx_tf_prefix_Unsqueeze_14/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Concat_4", "op": "ConcatV2", "input": ["StatefulPartitionedCall/onnx_tf_prefix_Unsqueeze_3", "unknown", "StatefulPartitionedCall/onnx_tf_prefix_Concat_4/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Concat_15", "op": "ConcatV2", "input": ["StatefulPartitionedCall/onnx_tf_prefix_Unsqueeze_14", "ConstantFolding/StatefulPartitionedCall/onnx_tf_prefix_Concat_15_partial_split_1", "StatefulPartitionedCall/onnx_tf_prefix_Concat_15/axis"], "attr": {"T": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Equal_11", "op": "Equal", "input": ["StatefulPartitionedCall/onnx_tf_prefix_Concat_4", "StatefulPartitionedCall/onnx_tf_prefix_Mul_10"], "attr": {"incompatible_shape_error": {"b": true}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Equal_1", "op": "Equal", "input": ["StatefulPartitionedCall/onnx_tf_prefix_Concat_15", "StatefulPartitionedCall/Const_1"], "attr": {"T": {"type": "DT_INT64"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Where_12", "op": "SelectV2", "input": ["StatefulPartitionedCall/onnx_tf_prefix_Equal_11", "StatefulPartitionedCall/onnx_tf_prefix_ConstantOfShape_8", "StatefulPartitionedCall/onnx_tf_prefix_Concat_4"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Where_1", "op": "Where", "input": ["StatefulPartitionedCall/Equal_1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/ones", "op": "Fill", "input": ["StatefulPartitionedCall/onnx_tf_prefix_Where_12", "StatefulPartitionedCall/ones/Const"], "attr": {"index_type": {"type": "DT_INT64"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Squeeze_1", "op": "Squeeze", "input": ["StatefulPartitionedCall/Where_1"], "attr": {"T": {"type": "DT_INT64"}, "squeeze_dims": {"list": {"i": ["-1"]}}}}, {"name": "StatefulPartitionedCall/mul", "op": "Mul", "input": ["unknown_0", "StatefulPartitionedCall/ones"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Shape_2", "op": "Shape", "input": ["StatefulPartitionedCall/mul"], "attr": {"out_type": {"type": "DT_INT64"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT64"}]}]}}, {"name": "StatefulPartitionedCall/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/Shape_2", "StatefulPartitionedCall/Squeeze_1", "StatefulPartitionedCall/GatherV2_1/axis"], "attr": {"batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT64"}, "Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/SparseToDense_1", "op": "SparseToDense", "input": ["StatefulPartitionedCall/Where_1", "StatefulPartitionedCall/Cast_3", "StatefulPartitionedCall/GatherV2_1", "StatefulPartitionedCall/zeros_1"], "attr": {"T": {"type": "DT_INT64"}, "validate_indices": {"b": true}, "Tindices": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/onnx_tf_prefix_Concat_15", "StatefulPartitionedCall/SparseToDense_1"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Reshape_16", "op": "Reshape", "input": ["StatefulPartitionedCall/mul", "StatefulPartitionedCall/add_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Concat_17", "op": "ConcatV2", "input": ["input", "StatefulPartitionedCall/onnx_tf_prefix_Reshape_16", "StatefulPartitionedCall/onnx_tf_prefix_Concat_17/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_MatMul_18", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/onnx_tf_prefix_Concat_17", "unknown_4"], "attr": {"adj_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_x": {"b": false}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Add_19", "op": "AddV2", "input": ["unknown_5", "StatefulPartitionedCall/onnx_tf_prefix_MatMul_18"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/onnx_tf_prefix_Constant_20", "StatefulPartitionedCall/onnx_tf_prefix_Add_19"], "attr": {"T": {"type": "DT_FLOAT"}, "equation": {"s": "Zm1uLGJtbmMtPmJjZg=="}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_MatMul_24", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/onnx_tf_prefix_Add_19", "unknown_7"], "attr": {"adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/einsum_1/Einsum", "op": "Einsum", "input": ["unknown_6", "StatefulPartitionedCall/einsum/Einsum"], "attr": {"equation": {"s": "Y2RmLGJjZi0+YmRm"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/einsum_2/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/einsum_1/Einsum", "StatefulPartitionedCall/onnx_tf_prefix_Constant_20"], "attr": {"T": {"type": "DT_FLOAT"}, "equation": {"s": "YmRmLGZtbi0+Ym1uZA=="}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_onnx_tf_prefix_Add_26", "op": "AddN", "input": ["StatefulPartitionedCall/einsum_2/Einsum", "StatefulPartitionedCall/onnx_tf_prefix_MatMul_24"], "attr": {"N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ArithmeticOptimizer/AddOpsRewrite_onnx_tf_prefix_Add_26", "op": "AddV2", "input": ["unknown_8", "StatefulPartitionedCall/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_onnx_tf_prefix_Add_26"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Relu_27", "op": "Relu", "input": ["StatefulPartitionedCall/ArithmeticOptimizer/AddOpsRewrite_onnx_tf_prefix_Add_26"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/einsum_3/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/onnx_tf_prefix_Constant_20", "StatefulPartitionedCall/onnx_tf_prefix_Relu_27"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "equation": {"s": "Zm1uLGJtbmMtPmJjZg=="}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_MatMul_31", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/onnx_tf_prefix_Relu_27", "unknown_10"], "attr": {"adj_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/einsum_4/Einsum", "op": "Einsum", "input": ["unknown_9", "StatefulPartitionedCall/einsum_3/Einsum"], "attr": {"equation": {"s": "Y2RmLGJjZi0+YmRm"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/einsum_5/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/einsum_4/Einsum", "StatefulPartitionedCall/onnx_tf_prefix_Constant_20"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "equation": {"s": "YmRmLGZtbi0+Ym1uZA=="}}}, {"name": "StatefulPartitionedCall/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_onnx_tf_prefix_Add_33", "op": "AddN", "input": ["StatefulPartitionedCall/einsum_5/Einsum", "StatefulPartitionedCall/onnx_tf_prefix_MatMul_31"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ArithmeticOptimizer/AddOpsRewrite_onnx_tf_prefix_Add_33", "op": "AddV2", "input": ["unknown_11", "StatefulPartitionedCall/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_onnx_tf_prefix_Add_33"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Relu_34", "op": "Relu", "input": ["StatefulPartitionedCall/ArithmeticOptimizer/AddOpsRewrite_onnx_tf_prefix_Add_33"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/einsum_6/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/onnx_tf_prefix_Constant_20", "StatefulPartitionedCall/onnx_tf_prefix_Relu_34"], "attr": {"T": {"type": "DT_FLOAT"}, "equation": {"s": "Zm1uLGJtbmMtPmJjZg=="}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_MatMul_38", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/onnx_tf_prefix_Relu_34", "unknown_13"], "attr": {"adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/einsum_7/Einsum", "op": "Einsum", "input": ["unknown_12", "StatefulPartitionedCall/einsum_6/Einsum"], "attr": {"T": {"type": "DT_FLOAT"}, "equation": {"s": "Y2RmLGJjZi0+YmRm"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/einsum_8/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/einsum_7/Einsum", "StatefulPartitionedCall/onnx_tf_prefix_Constant_20"], "attr": {"T": {"type": "DT_FLOAT"}, "equation": {"s": "YmRmLGZtbi0+Ym1uZA=="}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_onnx_tf_prefix_Add_40", "op": "AddN", "input": ["StatefulPartitionedCall/einsum_8/Einsum", "StatefulPartitionedCall/onnx_tf_prefix_MatMul_38"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/ArithmeticOptimizer/AddOpsRewrite_onnx_tf_prefix_Add_40", "op": "AddV2", "input": ["unknown_14", "StatefulPartitionedCall/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_onnx_tf_prefix_Add_40"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Relu_41", "op": "Relu", "input": ["StatefulPartitionedCall/ArithmeticOptimizer/AddOpsRewrite_onnx_tf_prefix_Add_40"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/einsum_9/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/onnx_tf_prefix_Constant_20", "StatefulPartitionedCall/onnx_tf_prefix_Relu_41"], "attr": {"equation": {"s": "Zm1uLGJtbmMtPmJjZg=="}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_MatMul_45", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/onnx_tf_prefix_Relu_41", "unknown_16"], "attr": {"adj_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/einsum_10/Einsum", "op": "Einsum", "input": ["unknown_15", "StatefulPartitionedCall/einsum_9/Einsum"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "equation": {"s": "Y2RmLGJjZi0+YmRm"}}}, {"name": "StatefulPartitionedCall/einsum_11/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/einsum_10/Einsum", "StatefulPartitionedCall/onnx_tf_prefix_Constant_20"], "attr": {"N": {"i": "2"}, "equation": {"s": "YmRmLGZtbi0+Ym1uZA=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_onnx_tf_prefix_Add_47", "op": "AddN", "input": ["StatefulPartitionedCall/einsum_11/Einsum", "StatefulPartitionedCall/onnx_tf_prefix_MatMul_45"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/ArithmeticOptimizer/AddOpsRewrite_onnx_tf_prefix_Add_47", "op": "AddV2", "input": ["unknown_17", "StatefulPartitionedCall/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_onnx_tf_prefix_Add_47"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Relu_48", "op": "Relu", "input": ["StatefulPartitionedCall/ArithmeticOptimizer/AddOpsRewrite_onnx_tf_prefix_Add_47"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/einsum_12/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/onnx_tf_prefix_Constant_20", "StatefulPartitionedCall/onnx_tf_prefix_Relu_48"], "attr": {"T": {"type": "DT_FLOAT"}, "equation": {"s": "Zm1uLGJtbmMtPmJjZg=="}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_MatMul_52", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/onnx_tf_prefix_Relu_48", "unknown_19"], "attr": {"adj_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/einsum_13/Einsum", "op": "Einsum", "input": ["unknown_18", "StatefulPartitionedCall/einsum_12/Einsum"], "attr": {"T": {"type": "DT_FLOAT"}, "equation": {"s": "Y2RmLGJjZi0+YmRm"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/einsum_14/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/einsum_13/Einsum", "StatefulPartitionedCall/onnx_tf_prefix_Constant_20"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "equation": {"s": "YmRmLGZtbi0+Ym1uZA=="}}}, {"name": "StatefulPartitionedCall/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_onnx_tf_prefix_Add_54", "op": "AddN", "input": ["StatefulPartitionedCall/einsum_14/Einsum", "StatefulPartitionedCall/onnx_tf_prefix_MatMul_52"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/ArithmeticOptimizer/AddOpsRewrite_onnx_tf_prefix_Add_54", "op": "AddV2", "input": ["unknown_20", "StatefulPartitionedCall/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_onnx_tf_prefix_Add_54"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Relu_55", "op": "Relu", "input": ["StatefulPartitionedCall/ArithmeticOptimizer/AddOpsRewrite_onnx_tf_prefix_Add_54"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_MatMul_56", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/onnx_tf_prefix_Relu_55", "unknown_21"], "attr": {"adj_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Add_57", "op": "AddV2", "input": ["unknown_22", "StatefulPartitionedCall/onnx_tf_prefix_MatMul_56"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Relu_58", "op": "Relu", "input": ["StatefulPartitionedCall/onnx_tf_prefix_Add_57"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_MatMul_59", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/onnx_tf_prefix_Relu_58", "unknown_23"], "attr": {"adj_x": {"b": false}, "adj_y": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Add_60", "op": "AddV2", "input": ["unknown_24", "StatefulPartitionedCall/onnx_tf_prefix_MatMul_59"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/onnx_tf_prefix_Add_60", "^StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/branch_executed/_38"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1482}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "unknown_24", "shape": [3], "dtype": "float32"}, {"name": "unknown_22", "shape": [64], "dtype": "float32"}, {"name": "unknown_20", "shape": [24], "dtype": "float32"}, {"name": "unknown_18", "shape": [24, 24, 468], "dtype": "float32"}, {"name": "unknown_17", "shape": [24], "dtype": "float32"}, {"name": "unknown_15", "shape": [24, 24, 468], "dtype": "float32"}, {"name": "unknown_14", "shape": [24], "dtype": "float32"}, {"name": "unknown_12", "shape": [24, 24, 468], "dtype": "float32"}, {"name": "unknown_11", "shape": [24], "dtype": "float32"}, {"name": "unknown_9", "shape": [24, 24, 468], "dtype": "float32"}, {"name": "unknown_8", "shape": [24], "dtype": "float32"}, {"name": "unknown_6", "shape": [24, 24, 468], "dtype": "float32"}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Constant_20", "shape": [468, 64, 64], "dtype": "float32"}, {"name": "unknown_5", "shape": [24], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Cast_3", "shape": [1], "dtype": "int32"}, {"name": "unknown_0", "shape": [1, 8192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Mul_10", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_ConstantOfShape_8", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Unsqueeze_3/dim", "shape": [], "dtype": "int32"}, {"name": "unknown", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Concat_4/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/ones/Const", "shape": [], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/then/_29/output/_43", "shape": [], "dtype": "bool"}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Unsqueeze_14/dim", "shape": [], "dtype": "int32"}, {"name": "ConstantFolding/StatefulPartitionedCall/onnx_tf_prefix_Concat_15_partial_split_1", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Concat_15/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Const_1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/zeros_1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Concat_17/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_4", "shape": [7, 24], "dtype": "float32"}, {"name": "unknown_7", "shape": [24, 24], "dtype": "float32"}, {"name": "unknown_10", "shape": [24, 24], "dtype": "float32"}, {"name": "unknown_13", "shape": [24, 24], "dtype": "float32"}, {"name": "unknown_16", "shape": [24, 24], "dtype": "float32"}, {"name": "unknown_19", "shape": [24, 24], "dtype": "float32"}, {"name": "unknown_21", "shape": [24, 64], "dtype": "float32"}, {"name": "unknown_23", "shape": [64, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/pivot_t/_33", "shape": [], "dtype": "bool"}, {"name": "StatefulPartitionedCall/LogicalAnd", "shape": [], "dtype": "bool"}, {"name": "StatefulPartitionedCall/assert_equal_1/y", "shape": [], "dtype": "bool"}, {"name": "StatefulPartitionedCall/assert_equal_1/All", "shape": [], "dtype": "bool"}, {"name": "StatefulPartitionedCall/FloorMod", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_Gather_2/axis", "shape": [], "dtype": "int32"}]}]}